{
  "runId": "uv6DfSm",
  "runUuid": "8543707f-6ff2-4a1b-a32e-0a8f0589609c",
  "participantName": "Kervin Leacock",
  "participantPhone": "9176700693",
  "timestamp": "2025-11-19T04:15:04.482Z",
  "waiverText": "\n<h4>Electronic Waiver of Liability, Media Release, and Code of Conduct</h4>\n<p><strong>Miami Beach Gay Runners (the \"Club\")</strong></p>\n<p><strong>PLEASE READ THIS DOCUMENT CAREFULLY. BY CLICKING \"I ACCEPT,\" YOU ARE WAIVING IMPORTANT LEGAL RIGHTS AND AGREEING TO ALL TERMS.</strong></p>\n\n<h4>1. ACKNOWLEDGMENT, MEDICAL FITNESS, AND ASSUMPTION OF RISK</h4>\n<p>I understand that participating in activities organized by the Club involves physical exertion and carries <strong>INHERENT RISKS</strong>, including but not limited to falls, traffic, weather, and equipment failure. I certify that I am <strong>MEDICALLY ABLE</strong> and properly trained. I understand and voluntarily assume the risk of exposure to <strong>COMMUNICABLE DISEASES, VIRUSES, AND BACTERIA</strong> (including COVID-19). I <strong>VOLUNTARILY ACKNOWLEDGE AND ASSUME ALL RISKS, KNOWN AND UNKNOWN</strong>, associated with my involvement.</p>\n\n<h4>2. GENERAL WAIVER, RELEASE, AND DISCHARGE OF LIABILITY</h4>\n<p>I permanently waive, release, and <strong>FOREVER DISCHARGE</strong> the Club, its officers, directors, employees, volunteers, <strong>PACEMAKERS (PACERS)</strong>, agents, sponsors, and representatives (the \"<strong>Released Parties</strong>\") from any and all claims, liabilities, demands, or damages that may arise from my participation, <strong>EVEN IF THE INJURY OR DAMAGE IS CAUSED BY THE ORDINARY NEGLIGENCE OR CARELESSNESS OF THE RELEASED PARTIES.</strong></p>\n\n<h4>3. ENHANCED INDEMNIFICATION, LEGAL COSTS, AND MEDICAL AUTHORIZATION</h4>\n<p><strong>INDEMNIFICATION AND LEGAL COSTS:</strong> I agree to protect, defend, and <strong>HOLD HARMLESS</strong> the Released Parties from any and all financial loss or cost they may incur. This includes my agreement to <strong>REIMBURSE AND PAY FOR ALL LEGAL AND OTHER COSTS</strong> (including reasonable attorneys' fees) incurred by the Released Parties in connection with any legal action that arises from or relates to my participation or alleged actions/omissions.</p>\n<p><strong>MEDICAL AUTHORIZATION:</strong> I consent to and authorize the Club's staff, volunteers, or emergency personnel to arrange for medical assistance in the event of my injury, and I hereby <strong>RELEASE THEM FROM ANY LIABILITY</strong> arising from such actions. I understand I am <strong>FINANCIALLY RESPONSIBLE</strong> for any resulting medical costs.</p>\n\n<h4>4. DISCLAIMER REGARDING PACERS AND GUIDANCE</h4>\n<p>I acknowledge that any Pacemakers (Pacers) are <strong>VOLUNTEERS</strong> offering non-professional guidance. The guidance is <strong>NOT</strong> professional coaching or medical advice. I remain <strong>SOLELY RESPONSIBLE</strong> for monitoring my own pace, health, safety, and adherence to all laws and rules.</p>\n\n<h4>5. MEDIA RELEASE AND CONSENT</h4>\n<p>I grant the Club the <strong>IRREVOCABLE, PERPETUAL, WORLDWIDE, AND ROYALTY-FREE RIGHT</strong> to use my name, voice, likeness, and image (collectively, \"Media\") captured during Club activities for <strong>MARKETING, ADVERTISING, PROMOTIONAL, AND COMMERCIAL USE</strong>. I waive any right to compensation or approval for the use of this Media.</p>\n\n<h4>6. CODE OF CONDUCT</h4>\n<p>I agree to abide by the Code of Conduct: I will treat all individuals with respect; harassment will not be tolerated. I will follow all traffic laws and safety instructions. Failure to comply may result in immediate dismissal from the Club.</p>\n\n<h4>7. GOVERNING LAW AND JURISDICTION</h4>\n<p>This agreement shall be governed by and interpreted under the laws of the <strong>State of Florida</strong>, and any legal action shall be brought exclusively in the courts of <strong>Miami-Dade County, Florida</strong>.</p>\n\n<h4>8. COMMUNICATION AND DISTRIBUTION CONSENT</h4>\n<p>I agree to receive operational and promotional communication via text message (SMS) and/or WhatsApp from the Club at the phone number provided during registration. I acknowledge that I am responsible for any costs or fees associated with receiving these messages (e.g., carrier data or SMS rates). I also consent to be added to the official Miami Beach Gay Runners distribution list for email and/or messaging updates.</p>\n\n<h4>9. ELECTRONIC CONSENT</h4>\n<p>I acknowledge that I have carefully read, fully understand, and agree to all terms of this Electronic Waiver. I am at least 18 years of age (or a parent/guardian signing on behalf of a minor). My electronic acceptance has the same legal force and effect as if I had signed a physical document.</p>\n"
}